---
type: DuctSizeIterator
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 9
tags: [revit-api, class]
---

# DuctSizeIterator

`Autodesk.Revit.DB.Mechanical.DuctSizeIterator` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetCurrent | 2013 | `public MEPSize GetCurrent ()` |
| Method | HasCurrent | 2013 | `public bool HasCurrent ()` |
| Method | IsDone | 2013 | `public virtual bool IsDone ()` |
| Method | MoveNext | 2013 | `public virtual bool MoveNext ()` |
| Method | Reset | 2013 | `public virtual void Reset ()` |
| Property | Current | — | `public virtual MEPSize Current { get ; }` |
| Property | CurrentObject | — | `internal Object CurrentObject { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |